<a href="https://colab.research.google.com/github/vladimir-1967/bs_4_test/blob/master/lesson_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [13]:
from google.colab import files
uploaded = files.upload()

Saving 2_taxi_nyc.csv to 2_taxi_nyc.csv

In [15]:
taxi = pd.read_csv("2_taxi_nyc.csv")

pickup_dt – период с точностью до часа
pickup_month – месяц
borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
pickups – число поездок за период (час)
hday – является ли день праздничным/выходным; Y - да,  N - нет
spd – скорость ветра в милях в час
vsb – видимость
temp – температура в градусах Фаренгейта
dewp – точка росы по Фаренгейту
slp – давление
pcp_01 – количество осадков за час
pcp_06 – количество осадков за 6 часов
pcp_24 – количество осадков за 24 часа
sd – глубина снега в дюймах

In [16]:
taxi.head()

             pickup_dt pickup_month    borough  ...  pcp 06 pcp 24   sd
0  2015-01-01 01:00:00          Jan      Bronx  ...     0.0    0.0  0.0
1  2015-01-01 01:00:00          Jan   Brooklyn  ...     0.0    0.0  0.0
2  2015-01-01 01:00:00          Jan        EWR  ...     0.0    0.0  0.0
3  2015-01-01 01:00:00          Jan  Manhattan  ...     0.0    0.0  0.0
4  2015-01-01 01:00:00          Jan     Queens  ...     0.0    0.0  0.0

[5 rows x 14 columns]

In [17]:
taxi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29101 entries, 0 to 29100
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pickup_dt     29101 non-null  object
 1   pickup_month  29101 non-null  object
 2   borough       26058 non-null  object
 3   pickups       29101 non-null  int64
 4   hday          29101 non-null  object
 5   spd           29101 non-null  float64
 6   vsb           29101 non-null  float64
 7   temp          29101 non-null  float64
 8   dewp          29101 non-null  float64
 9   slp           29101 non-null  float64
 10  pcp 01        29101 non-null  float64
 11  pcp 06        29101 non-null  float64
 12  pcp 24        29101 non-null  float64
 13  sd            29101 non-null  float64
dtypes: float64(9), int64(1), object(4)
memory usage: 3.1+ MB

In [18]:
taxi = taxi.rename(columns = {"pcp 01":"pcp_01",
                      "pcp 06":"pcp_06",
                      "pcp 24":"pcp_24"})

In [19]:
taxi.groupby("borough").agg({"borough":"count"})

               borough
borough
Bronx             4343
Brooklyn          4343
EWR               4343
Manhattan         4343
Queens            4343
Staten Island     4343

In [20]:
taxi.pickups.sum()

14265773

In [21]:
taxi.groupby(["borough"]).agg({"pickups":"sum"}).sum()

pickups    14259513
dtype: int64

In [22]:
taxi.groupby(["borough"]).agg({"pickups":"sum"})

                pickups
borough
Bronx            220047
Brooklyn        2321035
EWR                 105
Manhattan      10367841
Queens          1343528
Staten Island      6957

In [23]:
taxi.borough.unique()

array(['Bronx', 'Brooklyn', 'EWR', 'Manhattan', 'Queens', 'Staten Island',
       nan], dtype=object)

In [24]:
taxi[taxi.borough == "Manhattan"].agg({"pickups":"sum"})

pickups    10367841
dtype: int64

In [25]:
taxi[taxi.borough.isnull()].agg({"pickups":"sum"})

pickups    6260
dtype: int64

In [26]:
taxi.describe(include='all')

                  pickup_dt pickup_month  ...        pcp_24            sd
count                 29101        29101  ...  29101.000000  29101.000000
unique                 4343            6  ...           NaN           NaN
top     2015-04-12 07:00:00          May  ...           NaN           NaN
freq                      7         5058  ...           NaN           NaN
mean                    NaN          NaN  ...      0.090464      2.529169
std                     NaN          NaN  ...      0.219402      4.520325
min                     NaN          NaN  ...      0.000000      0.000000
25%                     NaN          NaN  ...      0.000000      0.000000
50%                     NaN          NaN  ...      0.000000      0.000000
75%                     NaN          NaN  ...      0.050000      2.958333
max                     NaN          NaN  ...      2.100000     19.000000

[11 rows x 14 columns]

In [27]:
taxi.groupby(["borough"]).agg({"pickups":"sum"}).sum() + 6260

pickups    14265773
dtype: int64

In [28]:
taxi.groupby(["borough","pickup_month"]).agg({"pickups":"sum"})

                            pickups
borough       pickup_month
Bronx         Apr             34617
              Feb             28694
              Jan             22461
              Jun             49006
              Mar             32232
              May             53037
Brooklyn      Apr            378095
              Feb            328650
              Jan            309011
              Jun            482466
              Mar            346726
              May            476087
EWR           Apr                10
              Feb                14
              Jan                11
              Jun                29
              Mar                14
              May                27
Manhattan     Apr           1648278
              Feb           1718571
              Jan           1455543
              Jun           1995388
              Mar           1661261
              May           1888800
Queens        Apr            216857
              Feb            185695
              Jan            159211
              Jun            286311
              Mar            219561
              May            275893
Staten Island Apr              1068
              Feb               903
              Jan               821
              Jun              1673
              Mar               975
              May              1517

In [29]:
min_pickups=taxi.groupby(["borough"]).agg({"pickups":"sum"}).idxmin()

In [30]:
taxi.query("hday=='Y'").groupby(["borough"]).agg({"pickups":"sum"})

               pickups
borough
Bronx             8027
Brooklyn         88011
EWR                  7
Manhattan       340000
Queens           53562
Staten Island      250

In [31]:
taxi.query("hday=='N'").groupby(["borough"]).agg({"pickups":"sum"})

                pickups
borough
Bronx            212020
Brooklyn        2233024
EWR                  98
Manhattan      10027841
Queens          1289966
Staten Island      6707